{
    "title": "Rent-A-Girlfriend",
    "summary": [{
            "section": 1,
            "title": "Kazuya's Breakup and Introduction to Rental Girlfriends",
            "details": [
                "Mami Nanami breaks up with Kazuya Kinoshita via text message after one month of dating.",
                "Kazuya, in his desperation, discovers the Diamond rental girlfriend app and books a date with Chizuru Mizuhara.",
                "On their first date, Chizuru acts as the perfect girlfriend: she compliments Kazuya, holds his hand, and even allows him to take a picture with her.",
                "Later, Kazuya overhears Chizuru speaking rudely to another client on the phone, dropping her sweet persona.",
                "Feeling deceived, Kazuya confronts Chizuru in public, calling her job fake and accusing her of playing with men's emotions.",
                "Despite this, Kazuya rents Chizuru again. During this date, he impulsively asks to touch her breasts, which she firmly refuses."
            ]
        },
        {
            "section": 2,
            "title": "The Fake Relationship Begins",
            "details": [
                "Kazuya receives a call that his grandmother Nagomi has been hospitalized due to collapsed lungs.",
                "At the hospital, Nagomi sees Chizuru (who happened to be there visiting her own grandmother) and assumes she's Kazuya's girlfriend.",
                "Kazuya, panicking, introduces Chizuru as his girlfriend to his family.",
                "Chizuru, seeing the family's joy, plays along and even bows formally, promising to take care of Kazuya.",
                "They discover they are neighbors in the same apartment complex and attend the same university.",
                "Kazuya begs Chizuru to continue the charade, offering to pay her rental fees, which she reluctantly accepts."
            ]
        },
        {
            "section": 3,
            "title": "Mami's Return and Complications",
            "details": [
                "Mami spots Kazuya and Chizuru together at the university and confronts Kazuya about his new 'girlfriend.'",
                "She invites herself to hang out with them, testing their relationship by asking probing questions about how they met and started dating.",
                "Mami later corners Chizuru in the bathroom, expressing doubt about their relationship and warning her about Kazuya's character.",
                "At a drinking party, Mami gets drunk and becomes clingy with Kazuya, causing him to struggle with his lingering feelings for her.",
                "Chizuru, seeing this, pretends to be drunk herself and asks Kazuya to take her home, effectively separating him from Mami."
            ]
        },
        {
            "section": 4,
            "title": "Introduction of Ruka",
            "details": [
                "Kazuya attends a group dating event where he meets Ruka Sarashina, another rental girlfriend.",
                "Ruka's heart rate, usually low due to a medical condition, spikes when she's around Kazuya.",
                "She becomes determined to pursue Kazuya, following him and investigating his relationship with Chizuru.",
                "Ruka discovers Chizuru works for the same rental girlfriend company and pieces together the truth about their fake relationship.",
                "She confronts them both, demanding explanations and insisting that she has genuine feelings for Kazuya."
            ]
        },
        {
            "section": 5,
            "title": "The Trial Relationship",
            "details": [
                "Ruka blackmails Kazuya by threatening to expose his arrangement with Chizuru to his grandmother.",
                "She demands that Kazuya enter a trial relationship with her for three months.",
                "Kazuya reluctantly agrees, setting ground rules like no physical intimacy beyond holding hands.",
                "Ruka pushes these boundaries, attempting to kiss Kazuya and showing up unannounced at his apartment.",
                "Chizuru maintains a professional demeanor but shows signs of jealousy, such as eavesdropping on Kazuya and Ruka's conversations."
            ]
        },
        {
            "section": 6,
            "title": "Sumi's Introduction",
            "details": [
                "Kazuya meets Sumi Sakurasawa when she's struggling with a difficult client during her rental girlfriend job.",
                "He steps in to help, pretending to be her boyfriend to deflect the pushy client.",
                "Sumi, extremely shy, can barely speak during their interactions. Kazuya suggests practice dates to help her improve.",
                "During these practice dates, Kazuya helps Sumi order food, engage in small talk, and build confidence in public settings.",
                "Sumi develops feelings for Kazuya but expresses them only in her thoughts or when alone, such as hugging a plush toy while thinking of him."
            ]
        },
        {
            "section": 7,
            "title": "The Movie Project",
            "details": [
                "Chizuru reveals to Kazuya that her dream is to star in a movie, inspired by a promise to her late grandfather.",
                "Kazuya learns that Chizuru's grandmother Sayuri is terminally ill and may not live to see Chizuru achieve her dream.",
                "He decides to produce an independent film starring Chizuru, despite having no filmmaking experience.",
                "Kazuya recruits a rookie director, raises funds through part-time jobs and crowdfunding, and even sells personal belongings to finance the project.",
                "They face numerous setbacks, including equipment failures, location problems, and Chizuru's initial struggles with acting."
            ]
        },
        {
            "section": 8,
            "title": "Chizuru's Grandmother's Passing",
            "details": [
                "As Sayuri's condition worsens, Kazuya and the film crew rush to complete a partial cut of the movie.",
                "They bring equipment to the hospital and show Sayuri the incomplete film on a laptop by her bedside.",
                "Sayuri watches Chizuru's performance with joy and pride before peacefully passing away.",
                "Chizuru, overwhelmed with grief, breaks down in the hospital corridor.",
                "Kazuya holds her as she cries, allowing her to release her emotions for the first time since her grandfather's death."
            ]
        },
        {
            "section": 9,
            "title": "The Girlfriend and the Paradise Arc",
            "details": [
                "Kazuya's grandmother Nagomi organizes a hot spring trip for the family, including Chizuru.",
                "Mami and Ruka invite themselves along, creating a tense situation.",
                "Kazuya repeatedly attempts to confess his feelings to Chizuru but is interrupted each time by other characters or circumstances.",
                "Mami corners Chizuru in the hot spring, questioning her relationship with Kazuya and hinting at knowing the truth.",
                "Ruka makes bold moves, such as sneaking into Kazuya's room at night and clinging to him in front of others."
            ]
        },
        {
            "section": 10,
            "title": "Truth Revelation and Aftermath",
            "details": [
                "Mami reveals the truth about the rental relationship to Nagomi by showing her Chizuru's profile on the rental girlfriend app.",
                "A confrontation ensues involving all parties: Kazuya, Chizuru, their families, Mami, and Ruka.",
                "Kazuya attempts to take all the blame, explaining how he forced Chizuru to continue the lie.",
                "Chizuru, moved by Kazuya's actions, admits to her own role in maintaining the deception.",
                "Nagomi and Kazuya's father express deep disappointment, questioning the authenticity of all their shared experiences."
            ]
        },
        {
            "section": 11,
            "title": "Ongoing Developments",
            "details": [
                "In the aftermath, Kazuya and Chizuru avoid each other, unsure how to proceed with their relationship.",
                "Kazuya finally musters the courage to confess his love to Chizuru face-to-face, but she doesn't give him a clear answer.",
                "Chizuru struggles with her feelings, torn between her growing love for Kazuya and her fear of losing another important person.",
                "Ruka continues to assert her position as Kazuya's 'trial girlfriend,' even preparing homemade lunches for him.",
                "Mami's background is explored, revealing a controlling family that has shaped her manipulative behavior.",
                "Chizuru and Kazuya go on a rental date. Kazuya confesses his feelings. Chizuru says she doesn't know how she feels for him however she will investigate/research her feelings to see what they are",
                "Chizuru invites Kazuya to her childhood home for some cleaning up to sell the house",
                "Childhome is clean. Chizuru shares some memories.",
                "Earthquakes happens and Kazuya is on top of Chizuru",
                "Kazuya wants to get off but chizuru holds him from the shirt to ask him to wait",
                "chizuru lies saying there is a leaf but the yget off",
                "Chizuru expression wants more",
                "Chizuru and Kazuya homes are destroyed",
                "Chizuru and Kazuya and Mini Yaemori are currently living together.",
                "Chizuru and Kazuya are living together for one month",
                "Chizuru gives kazuya a key ring fish",
                "Chizuru and Kazuya celebrate her birthday with Sumi chan. Sumi gives Chizuru a night PJ. Chizuru asks kazuya for his thoughts and he says they are cute",
                "Chizuru and Kazuya go on a date to nursery",
                "Chizuru is amazed as Kazuya is good with kids showing his fatherly side.",
                "Chizuru likes kazuya in his nursery clothes",
                "Chizuru is angry she cant make kazuya happy like children can. She is bad",
                "Kazuya asks Chizuru on a romantic date",
                "Chizuru is happy",
                "date is on may 17th",
                "preparations from both sides happen",
                "they go to TOKYO JOYPOLIS for the date",
                "Kazuya plans to ask Chizuru on their relationship",
                "Chizuru wants to end this investigating/research end of the month",
                "it is now the date",
                "Date happens, both enjoy their time.",
                "It's time to discuss their relationship"
            ]
        }
    ]
}